In [2]:
import pandas as pd
import numpy as np

In [ ]:
rng = np.random.RandomState(42) #42是随机种子

In [3]:
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [4]:
rng.randint(0,10,(3,4)) # 3行4列随机数

array([[6, 9, 2, 6],
       [7, 4, 3, 7],
       [7, 2, 5, 4]])

In [5]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)), # 把3行4列随机数做成表格（随机，所以不同上）
                  columns=['A','B','C','D'])  # 4列分别是ABCD
df

   A  B  C  D
0  1  7  5  1
1  4  0  9  5
2  8  0  9  2

In [12]:
# If apply a NumPy ufunc on either of these objects, 
# the result is another Pandas object with the indices preserved.
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [13]:
# Or, for a slightly more complex calculation
np.sin(df * np.pi / 4)

              A         B             C             D
0 -1.000000e+00  0.707107 -2.449294e-16  1.000000e+00
1  1.224647e-16  1.000000 -1.000000e+00  1.224647e-16
2 -2.449294e-16 -1.000000  7.071068e-01  7.071068e-01

In [14]:
# Example: suppose we are combining two different data sources, 
#  and find only the top three US states by area 
#  and the top three US states by population:

In [16]:
area = pd.Series({'Alaska': 1723337, 
                  'Texas': 695662,
                  'California': 423967}, 
                 name='area')

population = pd.Series({'California': 38332521, 
                        'Texas': 26448193,
                        'New York': 19651127}, 
                       name='population')

In [17]:
# Let's see what happens when we divide these 
#  to compute the population density:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [18]:
# The resulting array contains the union of
#   indices of the two input arrays
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [21]:
# missing number
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [22]:
A.add(B)

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [24]:
A.add(B, fill_value=0) #fill_value关键词

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [30]:
# Index alignment in DataFrame
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB')) # 用list分配columns的名字
A

   A  B
0  0  6
1  8  0

In [31]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  7  7  2
1  0  7  2
2  2  0  4

In [33]:
A + B

      A     B   C
0   7.0  13.0 NaN
1  15.0   0.0 NaN
2   NaN   NaN NaN

In [35]:
A

   A  B
0  0  6
1  8  0

In [34]:
A.stack()

0  A    0
   B    6
1  A    8
   B    0
dtype: int64

In [36]:
A.stack().mean()

3.5

In [41]:
# Here, fill with the mean of all values in A
#  (computed by first stacking the rows of A):
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B    C
0   7.0  13.0  5.5
1  15.0   0.0  5.5
2   3.5   5.5  7.5

In [42]:
fill

3.5

In [43]:
#
A = rng.randint(10, size=(3, 4))
A

array([[9, 6, 9, 8],
       [6, 8, 7, 1],
       [0, 6, 6, 7]])

In [46]:
A[0]

array([9, 6, 9, 8])

In [47]:
A[0].shape

(4,)

In [48]:
A - A[0] # 每一行都减去第一行

array([[ 0,  0,  0,  0],
       [-3,  2, -2, -7],
       [-9,  0, -3, -1]])

In [51]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0] # 每一行都减去第一行

   Q  R  S  T
0  0  0  0  0
1 -3  2 -2 -7
2 -9  0 -3 -1

In [55]:
df.iloc[0]

Q    9
R    6
S    9
T    8
Name: 0, dtype: int64

In [56]:
df

   Q  R  S  T
0  9  6  9  8
1  6  8  7  1
2  0  6  6  7

In [57]:
# column-wise
df.subtract(df['R'], axis=0) # 每一列都减去R列

   Q  R  S  T
0  3  0  3  2
1 -2  0 -1 -7
2 -6  0  0  1

In [59]:
df

   Q  R  S  T
0  9  6  9  8
1  6  8  7  1
2  0  6  6  7

In [61]:
halfrow = df.iloc[:1, :2] # 指定行列
halfrow

   Q  R
0  9  6

In [60]:
# automatically align
halfrow = df.iloc[::1, ::2] # 指定行列以前的所有
halfrow

   Q  S
0  9  9
1  6  7
2  0  6

In [69]:
df

   Q  R  S  T
0  9  6  9  8
1  6  8  7  1
2  0  6  6  7

In [70]:
halfrow

   Q  R
0  9  6
1  6  8
2  0  6

In [71]:
df - halfrow

   Q  R   S   T
0  0  0 NaN NaN
1  0  0 NaN NaN
2  0  0 NaN NaN

In [75]:
# Missing Data
import numpy as np
import pandas as pd

[1 None 3 4]

In [76]:
# None
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [2]:
# dtype = object
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
252 ms ± 10 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

dtype = int
10.4 ms ± 89.7 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [74]:
# error
vals1.sum()

In [77]:
# NaN
vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

In [78]:
# like a data virus
1 + np.nan

nan

In [79]:
0 * np.nan

nan

In [80]:
# no errors, but not always useful
vals2.sum(), vals2.min(), vals2.max()

/anaconda3/lib/python3.7/site-packages/numpy/core/_methods.py:32: RuntimeWarning: invalid value encountered in reduce
  return umr_minimum(a, axis, None, out, keepdims, initial)
/anaconda3/lib/python3.7/site-packages/numpy/core/_methods.py:28: RuntimeWarning: invalid value encountered in reduce
  return umr_maximum(a, axis, None, out, keepdims, initial)

(nan, nan, nan)

In [81]:
# NaN and None
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [88]:
x = pd.Series(range(9), dtype=int)
x

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
dtype: int64

In [89]:
x[0] = None #更改其中一个值
x

0    NaN
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
dtype: float64

In [90]:
# detecting null values
data = pd.Series([1, np.nan, 'hello', None])

In [91]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [93]:
data.isnull() # NaN 和 None都属于null

0    False
1     True
2    False
3     True
dtype: bool

In [94]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [22]:
data[data.notnull()] # 把notnull的取出来

0        1
2    hello
dtype: object

In [97]:
# remove NA
data.dropna() # 把isnull的扔掉，结果同上

0        1
2    hello
dtype: object

In [101]:
data.fillna("fill")

0        1
1     fill
2    hello
3     fill
dtype: object

In [114]:
# 一个无标题的 DataFrame
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [115]:
df.dropna() #扔掉有null的行

     0    1  2
1  2.0  3.0  5

In [116]:
df.dropna(axis='columns') #扔掉有null的列

   2
0  2
1  5
2  6

In [118]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [119]:
df[2] # 指的是index为2的列

0    2
1    5
2    6
Name: 2, dtype: int64

In [120]:
df[3] = np.nan # 加一列index为3，这一列全是nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [121]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [122]:
df.dropna(axis='columns', how ='any')

   2
0  2
1  5
2  6

In [35]:
df.dropna(how='any')

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [123]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [127]:
df.dropna(axis='rows', thresh=3) # 至少有3个数不为nan

     0    1  2   3
1  2.0  3.0  5 NaN

In [128]:
# filling null values
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [129]:
data.fillna(0) # 用0fill

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [130]:
# forward-fill
data.fillna(method='ffill') # 空处同上fill

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [131]:
# back-fill
data.fillna(method='bfill') # 空处同下fill

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [132]:
# DataFrame
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [48]:
df.fillna(method='ffill', axis=1) # 空处同左fill

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [134]:
df.fillna(method='bfill', axis=1) #空处同右fill

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  5.0 NaN
2  4.0  4.0  6.0 NaN

In [135]:
df1=df.fillna(method='ffill', axis=1)
df1.fillna(method='bfill', axis=1) #先同左后同右fill

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  4.0  4.0  6.0  6.0